Catalogs/НоменклатураПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НоменклатураПоставщиков</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>110</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПополнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияУНФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НоменклатураКонтрагентовБЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураКонтрагентовБЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияКод</Name>
					<Comment>ОКЕИ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторНоменклатурыСервиса</Name>
					<Comment>1С: Номенклатура</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторХарактеристикиСервиса</Name>
					<Comment>1С: Номенклатура</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УпаковкаНоменклатурыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодКомбинации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодыНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипНоменклатурыФНС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатурыФНС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоКТРУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаПроисхожденияКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХешПравилаПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНаименования</Name>
					<Comment>MD5 хеш от наименования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешАртикула</Name>
					<Comment>MD5 хеш от артикула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешКодаНоменклатуры</Name>
					<Comment>MD5 хеш от кода номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешШтрихкода</Name>
					<Comment>MD5 хеш от штрихкода</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецНоменклатурыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОстаткиТоваровПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиТоваровПоставщиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НоменклатураПоставщиков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти 

// Процедура для перехода на новый механизм сопоставления номенклатуры БЭД, 
// переносить данные из Справочник.Номенклатура поставщика в РегистрыСведений.НоменклатураКонтрагентовБЭД.
Процедура ПеренестиНоменклатуруПоставщиковВРегистрБЭД(Параметры) Экспорт
	
	Пока Истина Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	НоменклатураПоставщиков.Владелец КАК Владелец,
		|	МАКСИМУМ(НоменклатураПоставщиков.Номенклатура) КАК Номенклатура,
		|	МАКСИМУМ(НоменклатураПоставщиков.Характеристика) КАК Характеристика,
		|	МАКСИМУМ(НоменклатураПоставщиков.Артикул) КАК Артикул,
		|	НоменклатураПоставщиков.Идентификатор КАК Идентификатор,
		|	МАКСИМУМ(НоменклатураКонтрагентовБЭД.Номенклатура) КАК СопоставленнаяНоменклатура,
		|	МАКСИМУМ(НоменклатураПоставщиков.Наименование) КАК Наименование
		|ИЗ
		|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
		|		ПО НоменклатураПоставщиков.Владелец = НоменклатураКонтрагентовБЭД.Владелец
		|			И НоменклатураПоставщиков.Идентификатор = НоменклатураКонтрагентовБЭД.Идентификатор
		|ГДЕ
		|	НоменклатураПоставщиков.Владелец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И НоменклатураПоставщиков.Идентификатор <> """"
		|	И НоменклатураКонтрагентовБЭД.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураПоставщиков.Идентификатор,
		|	НоменклатураПоставщиков.Владелец
		|ИТОГИ ПО
		|	Владелец";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		ВыборкаПоВладельцу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВладельцу.Следующий() Цикл
			Набор = РегистрыСведений.НоменклатураКонтрагентовБЭД.СоздатьНаборЗаписей();
			Набор.Отбор.Владелец.Установить(ВыборкаПоВладельцу.Владелец);
			Набор.Прочитать();
			Выборка = ВыборкаПоВладельцу.Выбрать();
			Пока Выборка.Следующий() Цикл
				Запись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
		КонецЦикла;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
		
КонецПроцедуры

// Поля загрузки данных из внешнего источника.
// 
// Параметры:
//  ТаблицаПолейЗагрузки - см. ЗагрузкаДанныхИзВнешнегоИсточника.СоздатьТаблицуПолейОписанияЗагрузки
//  НастройкиЗагрузкиДанных - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт

	ОписанияТиповПолей = ЗагрузкаДанныхИзВнешнегоИсточника.НовыйОписанияТиповПолейЗагрузки();

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.НоменклатураПоставщиков");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", НСтр(
		"ru = 'Группа'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка, , , , );

	ИмяГруппыПолей = "НоменклатураПоставщиков";
	ПредставлениеГруппыНоменклатураПоставщиков = НСтр("ru='Номенклатура поставщиков'");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.НоменклатураПоставщиков");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АртикулПоставщика", НСтр(
		"ru = 'Артикул поставщика'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписаниеТиповКолонка, ИмяГруппыПолей,
		1, , Истина, , , , ПредставлениеГруппыНоменклатураПоставщиков);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ИдентификаторПоставщика",
		НСтр("ru = 'Идентификатор поставщика'"), ОписанияТиповПолей.ОписаниеТиповСтрока110, ОписаниеТиповКолонка,
		ИмяГруппыПолей, 2, , Истина, , , , ПредставлениеГруппыНоменклатураПоставщиков);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки,
		"НоменклатураПоставщиковНаименование", НСтр("ru = 'Номенклатура поставщиков (наименование)'"),
		ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка, ИмяГруппыПолей, 3, , Истина, , , ,
		ПредставлениеГруппыНоменклатураПоставщиков);

	ИмяГруппыПолей = "Номенклатура";
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПоляНоменклатуры(ТаблицаПолейЗагрузки, ОписаниеТиповКолонка,
		ОписанияТиповПолей, НастройкиЗагрузкиДанных);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПоляХарактеристики(ТаблицаПолейЗагрузки, ОписанияТиповПолей);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Остаток", НСтр(
		"ru = 'Остаток'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписанияТиповПолей.ОписаниеТиповЧисло10_0);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СрокПополнения", НСтр(
		"ru = 'Срок пополнения'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписанияТиповПолей.ОписаниеТиповЧисло10_0);
	
	// ДополнительныеРеквизиты
	НаборСвойств_Справочник_НоменклатураПоставщиков = УправлениеСвойствами.НаборСвойствПоИмени(
		"Справочник_НоменклатураПоставщиков");
	ЗагрузкаДанныхИзВнешнегоИсточника.ПодготовитьСоответствиеПоДополнительнымРеквизитам(НастройкиЗагрузкиДанных,
		НаборСвойств_Справочник_НоменклатураПоставщиков);

	Если НастройкиЗагрузкиДанных.ОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда

		ИмяПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяПоляДобавленияДополнительныхРеквизитов();
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, ИмяПоля, НСтр(
			"ru = 'Дополнительные реквизиты'"), ОписанияТиповПолей.ОписаниеТиповСтрока150,
			ОписанияТиповПолей.ОписаниеТиповСтрока11, , , , , , Истина, НаборСвойств_Справочник_НоменклатураПоставщиков);

	КонецЕсли;

КонецПроцедуры

// Сопоставить загружаемые данные из внешнего источника.
// 
// Параметры:
//  ПараметрыСопоставления - структура параметров
//  АдресРезультата - адрес
//
Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ОбновлятьДанные				= НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	ФиксированныйШаблон			= НастройкиЗагрузкиДанных.ФиксированныйШаблон;
	НастройкиПоиска				= НастройкиЗагрузкиДанных.НастройкиПоиска;	
	ПолноеИмяОбъектаЗаполнения 	= НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	ТаблицаДублирующихСтрок		= ПустаяТаблицаДублирующихСтрок();
	
	НастройкиПоиска.Вставить("ТаблицаДублирующихСтрок", ТаблицаДублирующихСтрок);

	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура поставщика по Артикулу, Идентификатору, Наименованию
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуруПоставщиков(СтрокаТаблицыФормы, НастройкиЗагрузкиДанных);		
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
		
			// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы, НастройкиПоиска);
		
		КонецЕсли; 
		
		// Характеристика по Владельцу и Наименованию
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Остаток
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Остаток, СтрокаТаблицыФормы.Остаток_ВходящиеДанные);
		
		// Срок пополнения
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.СрокПополнения, СтрокаТаблицыФормы.СрокПополнения_ВходящиеДанные);
				
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ТаблицаСопоставленияДанных.ЗагрузитьКолонку(ТаблицаДублирующихСтрок.ВыгрузитьКолонку("КлючСвязи"), "_КлючСвязи");

	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// Проверить корректность данных в строке таблицы.
// 
// Параметры:
//  СтрокаТаблицыФормы - строка с данными таблицы формы
//  ПолноеИмяОбъектаЗаполнения - необязательный параметр
//
Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	СтрокаТаблицыФормы._СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураПоставщиков);
	
	ИмяСлужебногоПоля_ЗагрузкаВПриложениеВозможна = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	ИмяСлужебногоПоля_ЗаполненыНеПолностью = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗаполненыНеПолностью();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля_ЗагрузкаВПриложениеВозможна] = СтрокаТаблицыФормы._СтрокаСопоставлена
		ИЛИ ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураПоставщиковНаименование);
										  	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля_ЗаполненыНеПолностью] = НЕ СтрокаТаблицыФормы._СтрокаСопоставлена
		И НЕ ПустаяСтрока(СтрокаТаблицыФормы.НоменклатураПоставщиковНаименование)
		И НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
		
КонецПроцедуры

// Обработать подготовленные данные.
// 
// Параметры:
//  СтруктураДанных - структура
//  ФоновоеЗаданиеАдресХранилища - адрес задания в хранилище
//
Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	НастройкиЗагрузкиДанных			= СтруктураДанных.НастройкиЗагрузкиДанных;
	ОбновлятьСуществующие			= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьЕслиНеСопоставлено		= СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ТаблицаСопоставленияДанных		= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных				= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции		= 0;
	ТранзакцияОткрыта				= Ложь;	
	ИспользоватьХарактеристики 		= ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");	
	ФОУчетГТД						= ПолучитьФункциональнуюОпцию("УчетГТД");
	
	ВременныеДанныеЗагрузки = Новый Структура;
	ВременныеДанныеЗагрузки.Вставить("СозданныеГруппы", Новый Соответствие); 
	ВременныеДанныеЗагрузки.Вставить("СоздатьСоответствиеЕГАИС", Ложь);
	
    Если ФОУчетГТД Тогда
		ТаблицаКлассификатораТНВЭД = Справочники.КлассификаторТНВЭД.ТаблицаКлассификатораТНВЭД();
		ВременныеДанныеЗагрузки.Вставить("ТаблицаКлассификатораТНВЭД", ТаблицаКлассификатораТНВЭД);
	КонецЕсли;
	
	Если НЕ ТранзакцияОткрыта 
		И КоличествоЗаписейТранзакции = 0 Тогда
		
		НачатьТранзакцию();
		ТранзакцияОткрыта = Истина;
		
	КонецЕсли; 
	
	Попытка
		
		Для Каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьЕслиНеСопоставлено);
				
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1; 
				
				// создадим элемент справочника номенклатура
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда   
					
					ЭлементСправочникаНоменклатура = ЗагрузитьЭлементСправочникаНоменклатура(СтрокаТаблицы, СтруктураДанных, 
						ВременныеДанныеЗагрузки);  
					
					ЗагрузитьСвязанныеДанныеНоменклатура(ЭлементСправочникаНоменклатура, СтрокаТаблицы, НастройкиЗагрузкиДанных, 
						ВременныеДанныеЗагрузки);	
					
				КонецЕсли;
				
				// создадим элемент справочника номенклатура поставщиков
				ЭлементСправочника = ЗагрузитьЭлементСправочникаНоменклатураПоставщиков(СтрокаТаблицы, НастройкиЗагрузкиДанных, 
					ИспользоватьХарактеристики);	
				
				ЗагрузитьСвязанныеДанные(ЭлементСправочника, СтрокаТаблицы, НастройкиЗагрузкиДанных);
					
			КонецЕсли;
			
			ИндексТекущейСтроки	= ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
			ТекстПрогресса		= СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейСтроки, РазмерТаблицыДанных);
			
			ДлительныеОперации.СообщитьПрогресс(Цел(ИндексТекущейСтроки * 100 / РазмерТаблицыДанных), ТекстПрогресса);
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияОткрыта 
			И КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.НоменклатураПоставщиков, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
		Возврат;
		
	КонецПопытки;
	
	Если ТранзакцияОткрыта Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры  

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Функция удаляет неиспользуемые имена поей.
//
Функция ПроверитьИУдалитьНеиспользуемыеИменаПолей(СтруктураДанных) Экспорт  
	
	ОбновленныеНастройкиЗагрузкиДанных 	= СтруктураДанных.НастройкиЗагрузкиДанных;	
	ИсходныеНастройкиЗагрузкиДанных 	= СтруктураДанных.НастройкиЗагрузкиДанных;
	
	Если ИсходныеНастройкиЗагрузкиДанных.Свойство("НастройкиОбновленияСвойств") Тогда
			
		Если ИсходныеНастройкиЗагрузкиДанных.НастройкиОбновленияСвойств.Свойство("ИменаПолейОбновляемые") Тогда 
			
			ИменаПолейОбновляемые = "Артикул,СчетУчетаДоходов,СчетУчетаЗапасов,СчетУчетаЗатрат,КатегорияНоменклатуры"; 
			
			ИменаПолей = ЗагрузкаДанныхИзВнешнегоИсточника.УдалитьНесуществующиеСвойства(
				СтрРазделить(ИменаПолейОбновляемые, ", "), 
					Метаданные.Справочники.Номенклатура.Реквизиты);

			ОбновленныеНастройкиЗагрузкиДанных.НастройкиОбновленияСвойств.ИменаПолейОбновляемые = ИменаПолей;   
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбновленныеНастройкиЗагрузкиДанных;
	
КонецФункции
	
#КонецОбласти  

#Область ЗагрузкаДанныхИзВнешнегоИсточника  

Функция ПустаяТаблицаДублирующихСтрок()
			
	Возврат ЗагрузкаДанныхИзВнешнегоИсточника.ПустаяТаблицаДублирующихСтрокНоменклатуры();
	
КонецФункции

Функция ЗагрузитьЭлементСправочникаНоменклатура(СтрокаТаблицы, СтруктураДанных, ВременныеДанныеЗагрузки) 
	
	ОбновленныеНастройкиЗагрузкиДанных = ПроверитьИУдалитьНеиспользуемыеИменаПолей(СтруктураДанных);
	СтруктураДанных.НастройкиЗагрузкиДанных = ОбновленныеНастройкиЗагрузкиДанных;
	
	Возврат Справочники.Номенклатура.ЗагрузитьЭлемент(СтрокаТаблицы, СтруктураДанных, ВременныеДанныеЗагрузки);	
	
КонецФункции

Функция ЗагрузитьЭлементСправочникаНоменклатураПоставщиков(СтрокаТаблицы, НастройкиЗагрузкиДанных, ИспользоватьХарактеристики) 
	
	Если СтрокаТаблицы._СтрокаСопоставлена И ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПоставщиков) Тогда
		
		ЭлементСправочника = СтрокаТаблицы.НоменклатураПоставщиков.ПолучитьОбъект();
		ЭлементСправочника.Заблокировать();
		
	Иначе
		
		ЭлементСправочника = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		ЭлементСправочника.Владелец = НастройкиЗагрузкиДанных.КонтрагентПоставщик;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПоставщиковНаименование) Тогда
		ЭлементСправочника.Наименование = СтрокаТаблицы.НоменклатураПоставщиковНаименование;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.АртикулПоставщика) Тогда
		ЭлементСправочника.Артикул = СтрокаТаблицы.АртикулПоставщика;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.ИдентификаторПоставщика) Тогда
		ЭлементСправочника.Идентификатор = СтрокаТаблицы.ИдентификаторПоставщика;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Остаток) 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементСправочника, "УдалитьОстаток") Тогда
		ЭлементСправочника.УдалитьОстаток = СтрокаТаблицы.Остаток;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТаблицы.СрокПополнения) Тогда
		ЭлементСправочника.СрокПополнения = СтрокаТаблицы.СрокПополнения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
		ЭлементСправочника.Номенклатура = СтрокаТаблицы.Номенклатура;
	КонецЕсли;
	
	Если ИспользоватьХарактеристики И НЕ ПустаяСтрока(СтрокаТаблицы.Характеристика) Тогда
		ЭлементСправочника.Характеристика = СтрокаТаблицы.Характеристика;
	КонецЕсли;
	
	Если НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты.Количество() > 0 Тогда 
			
		ЗагрузкаДанныхИзВнешнегоИсточника.ОбработатьВыбранныеДополнительныеРеквизиты(ЭлементСправочника, СтрокаТаблицы._СтрокаСопоставлена, 
			СтрокаТаблицы, НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты);
					
	КонецЕсли;
	
	ЭлементСправочника.Записать(); 
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции 

Процедура ЗагрузитьСвязанныеДанные(ЭлементСправочника, СтрокаТаблицы, НастройкиЗагрузкиДанных) 
	
	ЭтоЗагрузкаТабличнойЧасти = НастройкиЗагрузкиДанных.ЭтоЗагрузкаТабличнойЧасти; 
	
	ПроверитьИЗагрузитьОстаткиТоваровПоставщиков(ЭлементСправочника, СтрокаТаблицы, ЭтоЗагрузкаТабличнойЧасти);

КонецПроцедуры 

Процедура ЗагрузитьСвязанныеДанныеНоменклатура(ЭлементСправочника, СтрокаТаблицы, НастройкиЗагрузкиДанных, ВременныеДанныеЗагрузки) 
	
	Справочники.Номенклатура.ЗагрузитьСвязанныеДанные(ЭлементСправочника, СтрокаТаблицы, 
		НастройкиЗагрузкиДанных, ВременныеДанныеЗагрузки);	
	
КонецПроцедуры 
	
Процедура ПроверитьИЗагрузитьОстаткиТоваровПоставщиков(ЭлементСправочника, СтрокаТаблицы, ЭтоЗагрузкаТабличнойЧасти) 

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "Остаток") 
				И ЗначениеЗаполнено(СтрокаТаблицы.Остаток) И Не ЭтоЗагрузкаТабличнойЧасти Тогда
		
		ОстаткиТоваровПоставщиков = РегистрыСведений.ОстаткиТоваровПоставщиков.СоздатьМенеджерЗаписи();
		ОстаткиТоваровПоставщиков.НоменклатураПоставщика 	= ЭлементСправочника;
		ОстаткиТоваровПоставщиков.Количество				= СтрокаТаблицы.Остаток;
		
		ОстаткиТоваровПоставщиков.Записать(Истина);
		
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
